In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt


#create a new dataframe from a pyhton dictionary
data = {
    'Name': ['john', 'jane', 'Michal', 'Emily', 'David'],
    'Math': [85, 92, 78, np.nan, 98], #Notice that emily's math score is null
    'Science': [78, 45, 85, 91, 82]
}

df = pd.DataFrame(data);

df.describe()

            Math    Science
count   4.000000   5.000000
mean   88.250000  76.200000
std     8.655441  18.074844
min    78.000000  45.000000
25%    83.250000  78.000000
50%    88.500000  82.000000
75%    93.500000  85.000000
max    98.000000  91.000000

In [5]:
#Accessing a specific column
math_column = df['Math']
science_column = df['Science']

math_column

0    85.0
1    92.0
2    78.0
3     NaN
4    98.0
Name: Math, dtype: float64

In [6]:
#filter the data 
failing_science = df[df['Science'] < 50]

failing_science

   Name  Math  Science
1  jane  92.0       45

In [7]:
#sort the data
sorted_math_values = df.sort_values(by= 'Math', ascending=True)

sorted_math_values

     Name  Math  Science
2  Michal  78.0       85
0    john  85.0       78
1    jane  92.0       45
4   David  98.0       82
3   Emily   NaN       91

In [8]:
#adding a new column 
df['Total Score'] = df['Math'] + df['Science']

df

     Name  Math  Science  Total Score
0    john  85.0       78        163.0
1    jane  92.0       45        137.0
2  Michal  78.0       85        163.0
3   Emily   NaN       91          NaN
4   David  98.0       82        180.0

In [ ]:
#update data
df.loc[df['Name'] == 'Emily', 'Math'] = '12'


df

     Name  Math  Science  Total Score
0    john  85.0       78        163.0
1    jane  92.0       45        137.0
2  Michal  78.0       85        163.0
3   Emily    12       91          NaN
4   David  98.0       82        180.0

In [11]:
#grouping data and calculating mean of numeric columns
grouped = df.groupby('Math').mean(numeric_only=True)

grouped

      Science  Total Score
Math
78.0     85.0        163.0
85.0     78.0        163.0
92.0     45.0        137.0
98.0     82.0        180.0
12       91.0          NaN

In [18]:
#lockating  data
michael_science_score = df.loc[df['Name'] == 'Michal', 'Science']
michael_science_score

2    85
Name: Science, dtype: int64

In [ ]:
#locate data  by index position
third_row = df.iloc[2]
third_row